<?php

$lang['db_invalid_connection_str'] = 'نەتوانرا داتابەیسەکە دیاریبکرێت پشتبەستوو بەو زانیارییانەی تۆمارت کردووە.';
$lang['db_unable_to_connect'] = 'نەتوانرا داتابیسەکەت بلکێنرێت بە سوود وەرگرتن لە زانیارییانەی تۆمارتکردووە.';
$lang['db_unable_to_select'] = 'نەتوانرا داتاباەیسی دیاریکراو دەستنیشانبکرێت: %s';
$lang['db_unable_to_create'] = 'نەتوانرا داتابەیسی دیاریکراو دروستبکرێت: %s';
$lang['db_invalid_query'] = 'ئەو داواکراوەی ناردوتە هەڵەیە.';
$lang['db_must_set_table'] = 'پێویستە خشتە بۆ داتابەیسەکەت ئامادە بکەیت بۆ ئەوەی لەگەڵ داواکارییەکەت کاربکات.';
$lang['db_must_use_set'] = 'پێویستە شیوازی (set) بەکاربهێنی بۆ نوێکردنەوەی تۆمارێک.';
$lang['db_must_use_index'] = 'پێویستە ئیندێکسێک دیاریبکەیت بۆ بەراورد نوێکردنەوەکاندا.';
$lang['db_batch_missing_index'] = 'رۆوێک (row) یان زیاتر نێردراوە بۆ نوێکردنەوە دیار نییە لە ئیندێکسی دیاریکراودا.';
$lang['db_must_use_where'] = 'نوێکردنەوە ڕێپێدراو نییە هەتاکو (where) تیا نەبێت.';
$lang['db_del_must_use_where'] = 'سڕینەوە ڕێپێدراو نیەە هەتاکو (where) یان (like) بەکار نەهێنرێت.';
$lang['db_field_param_missing'] = 'بۆ ڕاکێسانی خانەکان پێویستە ناوی خشتەکە دایریبکرێت وەک پارامێتەرێک.';
$lang['db_unsupported_function'] = 'ئەم تایبەتمەندییە بەردەست نییە بۆ ئەو داتابەیسەی تۆ بەکاریدەهێنیت.';
$lang['db_transaction_failure'] = 'گواستنەوەکان شکستیانهێنا: گەڕاندنەوە چێبەجێکرا.';
$lang['db_unable_to_drop'] = 'نەتوانرا داتابەیسی دیاریکراو بسڕدرێتەوە.';
$lang['db_unsuported_feature'] = 'تایبەتمەندییەکی پاڵپشت نەکراو لەو ئامێری داتابەیسەی بەکاریدێنیت.';
$lang['db_unsuported_compression'] = 'ئەو جۆری فۆرماتی گوشاری پەڕگەیەی هەڵتبژاردووە پاڵپشت نەکراوە لە لایەن خزمەتکارەکەتوە.';
$lang['db_filepath_error'] = 'نەتوانرا داتا تۆماربکرێت لەو ڕێچکەی فایلەی دیاریتکردووە.';
$lang['db_invalid_cache_path'] = 'ئەو ڕێچکەی حەشارگەیەی دیاریتکردووە هەڵەیە یان ئامادە نییە بۆ تۆمارکردن.';
$lang['db_table_name_required'] = 'ناوی خشتە پێویستە بۆ ئەم کردارە.';
$lang['db_column_name_required'] = 'ناوی ستوون پێویستە بۆ ئەم کردارە.';
$lang['db_column_definition_required'] = 'پێناسەی ستوون پێویستە بۆ ئەم کردارە.';
$lang['db_unable_to_set_charset'] = 'نەتوانرا کۆمەڵەی پیتەکانی ڕاژەخواز  دابنرێت: %s';
$lang['db_error_heading'] = 'هەڵەیەک لە داتابەیسدا ڕویدا.';

/* End of file db_lang.php */
/* Location: ./system/language/kurdish/db_lang.php */