<?php

$lang['required']			= "خانەی %s پێویستە.";
$lang['isset']				= "خانەی %s پێویستە نرخی هەبێت.";
$lang['valid_email']		= "خانەی %s پێویستە ئیمەیڵێکی دروستی تیابێت.";
$lang['valid_emails']		= "خانەی %s پێویستە هەموو ئیمەیڵە دروستەکانی تیادا تیابێت.";
$lang['valid_url']			= "خانەی %s پێویستە لینکێکی دروستی تیابێت.";
$lang['valid_ip']			= "خانەی %s پێویستە IP دروستی تیابێت.";
$lang['min_length']			= "خانەی %s پێویستە بەلانی کەمەوە %s پیت درێژ بێت.";
$lang['max_length']			= "خانەی %s نابێت لە %s پیت تێپەڕبکات.";
$lang['exact_length']		= "خانەی %s پێویستە %s پیت بێت.";
$lang['alpha']				= "خانەی %s ئەبێت تەنها پیتەکانی ئەبجەدی تیابێت.";
$lang['alpha_numeric']		= "خانەی %s پێویستە تەنها ژمارەی تیابێت.";
$lang['alpha_dash']			= "خانەی %s پێویستە تەنها ژمارەی تیابێت, بنهێڵ, وە داش (dashes).";
$lang['numeric']			= "خانەی %s پێویستە تەنها ژمارەی تیابێت.";
$lang['is_numeric']			= "خانەی %s پێویستە تەنها ژمارەی تیابێت.";
$lang['integer']			= "خانەی %s پێویستە تەنها ژمارەی ڕاستی تیابێت.";
$lang['regex_match']		= "خانەی %s فۆرماتەکەی تەواو نییە.";
$lang['matches']			= "خانەی %s وەک خانەی %s نییە.";
$lang['is_unique'] 			= "خانەی %s پێویستە نرخێکی بێ هاوتای تیابێت.";
$lang['is_natural']			= "خانەی %s پێویستە تەنها ژمارەی پۆزەتیڤی تیابێت.";
$lang['is_natural_no_zero']	= "خانەی %s پێویستە نرخێکی تیابێت گەرەتربێت لە سفر.";
$lang['decimal']			= "خانەی %s پێویستە ژمارەی دەیی تیابێت.";
$lang['less_than']			= "خانەی %s پێویستە ژمارەیەکی تیابێت کەمتر بێت لە %s.";
$lang['greater_than']		= "خانەی %s پێویستە ژمارەیەکی تیابێت گەورەتربێت لە %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/kurdish/form_validation_lang.php */