<?php

$lang['ftp_no_connection']			= "نەتوانرا شوێنی ناسنامەی (ID) پەیوەندی دروست دیاریبکرێت. تکایە دڵنیابەرەوە کە کە لکێندراوی پێش هەر کردارێکی پەڕگەیی ڕۆتینیی.";
$lang['ftp_unable_to_connect']		= "نەتوانرا پەیوەست بکرێیت بە خزمەتکاری FTP لە ڕێی ئەو ناوی خانەخوێیەوە.";
$lang['ftp_unable_to_login']		= "نەتتوانی بچیتە ناو ڕاژەی FTP. تکایە دڵنیابەرەوە لە ناوی بەکارهێنەر و تێپەڕەووشە.";
$lang['ftp_unable_to_makdir']		= "نەتوانرا ئەو بوخچەیە دروستبکرێت کە دیاریت کردبو.";
$lang['ftp_unable_to_changedir']	= "نەتوانرا گۆڕانکاری لە بوخچەکاندا بکرێت.";
$lang['ftp_unable_to_chmod']		= "نەتوانرا مۆڵەتپێدانەکانی پەڕگە دابنرێن. تکایە دڵنیابەرەوە لە ڕێچکەکەت. سەرنج: ئەم تایبەتمەندییە تەنها لە PHP 5 یان بەرزتر بونی هەیە.";
$lang['ftp_unable_to_upload']		= "نەتوانرا پەڕگەی دیاریکراو بەرزبکرێتەوە. تکایە دڵنیابەرەوە لە ڕێچکەکەت.";
$lang['ftp_unable_to_download']		= "نەتوانرا پەڕگەی دیاریکراو دابگیرێت. تکایە دڵنیابەرەوە لە ڕێچکەکەت";
$lang['ftp_no_source_file']			= "نەتوانرا سەرچاوەی پەڕگەکەت دیاریبکرێت. تکایە دڵنیابەرەوە لە ڕێچکەکەت.";
$lang['ftp_unable_to_rename']		= "نەتوانرا پەڕگەی دیاریکراو ناوەکەی بگٶڕدرێت.";
$lang['ftp_unable_to_delete']		= "نەتوانرا پەڕگەیی دیاریکراو بسڕدرێتەوە.";
$lang['ftp_unable_to_move']			= "نەتوانرا پەڕگەکە بگوازرێتەوە. تکایە دڵنیابەرەوە کە بوخچەیە وەرگر بونی هەیە.";


/* End of file ftp_lang.php */
/* Location: ./system/language/kurdish/ftp_lang.php */